{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "import re\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Credenciais de conexão com o Neo4j\n",
    "url = \"neo4j+s://XXXXXX.databases.neo4j.io\"\n",
    "usuario = \"neo4j\"\n",
    "senha = \"secret-key\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Carregar os dados do arquivo JSON\n",
    "with open('pokemon_data.json', 'r', encoding='utf-8') as file:\n",
    "    pokemon_data = json.load(file)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Base de dados carregada\n"
     ]
    }
   ],
   "source": [
    "# Classe para criar o grafo dos Pokémons\n",
    "class PokemonGraph:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def carrega_base(self, pokemon_data):\n",
    "        with self.driver.session() as session:\n",
    "            session.execute_write(self._zera_base)\n",
    "            session.execute_write(self._create_graph, pokemon_data)\n",
    "\n",
    "    @staticmethod\n",
    "    def _zera_base(tx):\n",
    "        tx.run(\"\"\"\n",
    "        MATCH (n)\n",
    "        DETACH DELETE n\n",
    "        \"\"\")\n",
    "\n",
    "    @staticmethod\n",
    "    def _create_graph(tx, pokemon_data):\n",
    "        for pokemon in pokemon_data:\n",
    "            # Corrigir o peso removendo caracteres especiais\n",
    "            peso = float(re.sub(r'[^\\d.]', '', pokemon['weight']))\n",
    "\n",
    "            # Criar nós dos Pokémons\n",
    "            tx.run(\"\"\"\n",
    "            MERGE (p:POKEMON {\n",
    "                nome: $nome, \n",
    "                numero: $numero, \n",
    "                especie: $especie, \n",
    "                altura: $altura, \n",
    "                peso: $peso\n",
    "            })\n",
    "            \"\"\", \n",
    "            nome=pokemon['name'], \n",
    "            numero=pokemon['number'], \n",
    "            especie=pokemon['species'], \n",
    "            altura=pokemon['height'], \n",
    "            peso=peso)\n",
    "            \n",
    "            # Criar tipos de Pokémon\n",
    "            for tipo in pokemon['types']:\n",
    "                tx.run(\"\"\"\n",
    "                MERGE (t:TIPO {nome: $tipo})\n",
    "                MERGE (p:POKEMON {nome: $nome})\n",
    "                MERGE (p)-[:TEM_TIPO]->(t)\n",
    "                \"\"\", \n",
    "                tipo=tipo, \n",
    "                nome=pokemon['name'])\n",
    "\n",
    "            # Criar relações de evolução\n",
    "            if 'evolution' in pokemon and isinstance(pokemon['evolution'], list):\n",
    "                for evolucao in pokemon['evolution']:\n",
    "                    tx.run(\"\"\"\n",
    "                    MERGE (p:POKEMON {nome: $nome})\n",
    "                    MERGE (e:POKEMON {numero: $numero_evolucao, nome: $nome_evolucao})\n",
    "                    MERGE (p)-[:EVOLUI_PARA]->(e)\n",
    "                    \"\"\",\n",
    "                    nome=pokemon['name'],\n",
    "                    numero_evolucao=evolucao['number'],\n",
    "                    nome_evolucao=evolucao['name'])\n",
    "\n",
    "            # Criar habilidades\n",
    "            if 'abilities' in pokemon and isinstance(pokemon['abilities'], list):\n",
    "                for habilidade in pokemon['abilities']:\n",
    "                    tx.run(\"\"\"\n",
    "                    MERGE (p:POKEMON {nome: $nome})\n",
    "                    MERGE (h:HABILIDADE {nome: $nome_habilidade})\n",
    "                    MERGE (p)-[:TEM_HABILIDADE]->(h)\n",
    "                    \"\"\",\n",
    "                    nome=pokemon['name'],\n",
    "                    nome_habilidade=habilidade['name'])\n",
    "\n",
    "# Executar o código para carregar o grafo\n",
    "db = PokemonGraph(url, usuario, senha)\n",
    "db.carrega_base(pokemon_data)\n",
    "db.close()\n",
    "print(\"Base de dados carregada\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Classe de conexão e consultas no Neo4j\n",
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "\n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "\n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try:\n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session()\n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally:\n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Função de consulta\n",
    "def consultar(query):\n",
    "    conn = Neo4jConnection(uri=url, user=usuario, pwd=senha)\n",
    "    resultado = conn.query(query)\n",
    "    conn.close()\n",
    "    return resultado"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pokémons que podem atacar um Pikachu baseado na sua fraqueza e peso maior que 10kg:\n",
      "Nidoking\n",
      "Iron Treads\n",
      "Ting-Lu\n",
      "Sandy Shocks\n",
      "Great Tusk\n",
      "Clodsire\n",
      "Toedscruel\n",
      "Ursaluna\n",
      "Runerigus\n",
      "Sandaconda\n",
      "Palossand\n",
      "Mudsdale\n",
      "Mudbray\n",
      "Diggersby\n",
      "Landorus\n",
      "Golurk\n",
      "Golett\n",
      "Stunfisk\n",
      "Krookodile\n",
      "Krokorok\n",
      "Sandile\n",
      "Seismitoad\n",
      "Palpitoad\n",
      "Excadrill\n",
      "Mamoswine\n",
      "Rhyperior\n",
      "Gliscor\n",
      "Hippowdon\n",
      "Hippopotas\n",
      "Garchomp\n",
      "Gabite\n",
      "Gible\n",
      "Gastrodon\n",
      "Torterra\n",
      "Groudon\n",
      "Claydol\n",
      "Baltoy\n",
      "Whiscash\n",
      "Flygon\n",
      "Vibrava\n",
      "Numel\n",
      "Trapinch\n",
      "Camerupt\n",
      "Swampert\n",
      "Marshtomp\n",
      "Pupitar\n",
      "Larvitar\n",
      "Donphan\n",
      "Phanpy\n",
      "Piloswine\n",
      "Steelix\n",
      "Gligar\n",
      "Quagsire\n",
      "Rhydon\n",
      "Rhyhorn\n",
      "Marowak\n",
      "Onix\n",
      "Golem\n",
      "Nidoqueen\n",
      "Sandslash\n",
      "Sandshrew\n",
      "Dugtrio\n",
      "Iron Crown\n",
      "Veluza\n",
      "Farigiraf\n",
      "Espathra\n",
      "Wyrdeer\n",
      "Mr. Rime\n",
      "Orbeetle\n",
      "Dottler\n",
      "Cosmoem\n",
      "Tapu Lele\n",
      "Lunala\n",
      "Solgaleo\n",
      "Bruxish\n",
      "Oranguru\n",
      "Malamar\n",
      "Delphox\n",
      "Braviary\n",
      "Beheeyem\n",
      "Reuniclus\n",
      "Sigilyph\n",
      "Gothitelle\n",
      "Swoobat\n",
      "Musharna\n",
      "Cresselia\n",
      "Gallade\n",
      "Mime Jr.\n",
      "Bronzong\n",
      "Bronzor\n",
      "Deoxys\n",
      "Latios\n",
      "Latias\n",
      "Metagross\n",
      "Metang\n",
      "Beldum\n",
      "Wynaut\n",
      "Claydol\n",
      "Baltoy\n",
      "Solrock\n",
      "Lunatone\n",
      "Grumpig\n",
      "Spoink\n",
      "Gardevoir\n",
      "Lugia\n",
      "Girafarig\n",
      "Wobbuffet\n",
      "Espeon\n",
      "Slowking\n",
      "Xatu\n",
      "Mewtwo\n",
      "Articuno\n",
      "Jynx\n",
      "Mr. Mime\n",
      "Starmie\n",
      "Exeggutor\n",
      "Hypno\n",
      "Drowzee\n",
      "Slowpoke\n",
      "Alakazam\n",
      "Slowbro\n",
      "Kadabra\n",
      "Rapidash\n",
      "Abra\n",
      "Raichu\n"
     ]
    }
   ],
   "source": [
    "# Consultas\n",
    "# Quais Pokémon podem atacar um Pikachu pelo sua fraqueza (tipo que lhe pode causar mais dano) cujo o peso é mais de 10kg?\n",
    "print(\"Pokémons que podem atacar um Pikachu baseado na sua fraqueza e peso maior que 10kg:\")\n",
    "resultado1 = consultar(\"\"\"\n",
    "MATCH (p:POKEMON)-[:TEM_TIPO]->(t:TIPO)\n",
    "WHERE t.nome IN ['Ground', 'Psychic'] AND p.peso > 10\n",
    "RETURN p.nome AS Pokemon\n",
    "\"\"\")\n",
    "for registro in resultado1:\n",
    "    print(registro['Pokemon'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Tipo mais comum de um Pokémon que é atacado pelo tipo Gelo:\n",
      "Ice\n"
     ]
    }
   ],
   "source": [
    "# Qual é o tipo mais comum de um Pokémon que é atacado pelo tipo gelo?\n",
    "print(\"\\nTipo mais comum de um Pokémon que é atacado pelo tipo Gelo:\")\n",
    "resultado2 = consultar(\"\"\"\n",
    "MATCH (p:POKEMON)-[:TEM_TIPO]->(t:TIPO)\n",
    "WHERE t.nome = 'Ice'\n",
    "RETURN t.nome AS Tipo, COUNT(*) AS Quantidade\n",
    "ORDER BY Quantidade DESC\n",
    "LIMIT 1\n",
    "\"\"\")\n",
    "for registro in resultado2:\n",
    "    print(registro['Tipo'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Quantidade de segundas e terceiras evoluções que fazem um Pokémon dobrar de peso:\n",
      "344\n"
     ]
    }
   ],
   "source": [
    "# Quantas segundas e terceiras evoluções que fazem um Pokémon no mínimo dobrar de peso?\n",
    "print(\"\\nQuantidade de segundas e terceiras evoluções que fazem um Pokémon dobrar de peso:\")\n",
    "resultado3 = consultar(\"\"\"\n",
    "MATCH (p1:POKEMON)-[:EVOLUI_PARA]->(p2:POKEMON)\n",
    "WHERE p2.peso >= p1.peso * 2\n",
    "RETURN COUNT(*) AS Total\n",
    "\"\"\")\n",
    "for registro in resultado3:\n",
    "    print(registro['Total'])\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
